GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_cpu_scs.h
// Debug Fault Status Register
#define CPU_SCS_O_DFSR                                              0x00000D30

// Mem Manage Fault Address Register
#define CPU_SCS_O_MMFAR                                             0x00000D34

// Bus Fault Address Register
#define CPU_SCS_O_BFAR                                              0x00000D38

// Auxiliary Fault Status Register
#define CPU_SCS_O_AFSR                                              0x00000D3C

// Processor Feature Register 0
#define CPU_SCS_O_ID_PFR0                                           0x00000D40

// Processor Feature Register 1
#define CPU_SCS_O_ID_PFR1                                           0x00000D44

// Debug Feature Register 0
#define CPU_SCS_O_ID_DFR0                                           0x00000D48

// Auxiliary Feature Register0
#define CPU_SCS_O_ID_AFR0                                           0x00000D4C

// Memory Model Feature Register 0
#define CPU_SCS_O_ID_MMFR0                                          0x00000D50

// Memory Model Feature Register 1
#define CPU_SCS_O_ID_MMFR1                                          0x00000D54

// Memory Model Feature Register 2
#define CPU_SCS_O_ID_MMFR2                                          0x00000D58

// Memory Model Feature Register3
#define CPU_SCS_O_ID_MMFR3                                          0x00000D5C

// ISA Feature Register 0
#define CPU_SCS_O_ID_ISAR0                                          0x00000D60

// ISA Feature Register 1
#define CPU_SCS_O_ID_ISAR1                                          0x00000D64

// ISA Feature Register 2
#define CPU_SCS_O_ID_ISAR2                                          0x00000D68

// ISA Feature Register 3
#define CPU_SCS_O_ID_ISAR3                                          0x00000D6C

// ISA Feature Register 4
#define CPU_SCS_O_ID_ISAR4                                          0x00000D70

// Coprocessor Access Control Register
#define CPU_SCS_O_CPACR                                             0x00000D88

// Debug Halting Control and Status Register
#define CPU_SCS_O_DHCSR                                             0x00000DF0

// Deubg Core Register Selector Register
#define CPU_SCS_O_DCRSR                                             0x00000DF4

// Debug Core Register Data Register
#define CPU_SCS_O_DCRDR                                             0x00000DF8

// Debug Exception and Monitor Control Register
#define CPU_SCS_O_DEMCR                                             0x00000DFC

// Software Trigger Interrupt Register
#define CPU_SCS_O_STIR                                              0x00000F00

//*****************************************************************************
//
// Register: CPU_SCS_O_ICTR
//
//*****************************************************************************
// Field: [2:0] INTLINESNUM
//
// Total number of interrupt lines in groups of 32.
//
// 0: 0...32
// 1: 33...64
// 2: 65...96
// 3: 97...128
// 4: 129...160
// 5: 161...192
// 6: 193...224
// 7: 225...256
//
//
#define CPU_SCS_ICTR_INTLINESNUM_M                                  0x00000007
#define CPU_SCS_ICTR_INTLINESNUM_S                                  0

//*****************************************************************************
//
// Register: CPU_SCS_O_ACTLR
//
//*****************************************************************************
// Field: [2]    DISFOLD
//
// Disables folding of IT instruction.
#define CPU_SCS_ACTLR_DISFOLD                                       0x00000004
#define CPU_SCS_ACTLR_DISFOLD_BITN                                  2
#define CPU_SCS_ACTLR_DISFOLD_M                                     0x00000004
#define CPU_SCS_ACTLR_DISFOLD_S                                     2

// Field: [1]    DISDEFWBUF
//
// Disables write buffer use during default memory map accesses. This causes all
// bus faults to be precise bus faults but decreases the performance of the
// processor because the stores to memory have to complete before the next
// instruction can be executed.
#define CPU_SCS_ACTLR_DISDEFWBUF                                    0x00000002
#define CPU_SCS_ACTLR_DISDEFWBUF_BITN                               1
#define CPU_SCS_ACTLR_DISDEFWBUF_M                                  0x00000002
#define CPU_SCS_ACTLR_DISDEFWBUF_S                                  1

// Field: [0]    DISMCYCINT
//
// Disables interruption of multi-cycle instructions. This increases the interrupt
// latency of the processor becuase LDM/STM completes before interrupt stacking
// occurs.
#define CPU_SCS_ACTLR_DISMCYCINT                                    0x00000001
#define CPU_SCS_ACTLR_DISMCYCINT_BITN                               0
#define CPU_SCS_ACTLR_DISMCYCINT_M                                  0x00000001
#define CPU_SCS_ACTLR_DISMCYCINT_S                                  0

//*****************************************************************************
//
// Register: CPU_SCS_O_STCSR
//
//*****************************************************************************
// Field: [16]    COUNTFLAG
//
// Returns 1 if timer counted to 0 since last time this was read. Clears on read by
// application of any part of the SysTick Control and Status Register. If read by
// the debugger using the DAP, this bit is cleared on read-only if the MasterType
// bit in the AHB-AP Control Register is set to 0. Otherwise, COUNTFLAG is not
// changed by the debugger read.
#define CPU_SCS_STCSR_COUNTFLAG                                     0x00010000
#define CPU_SCS_STCSR_COUNTFLAG_BITN                                16
#define CPU_SCS_STCSR_COUNTFLAG_M                                   0x00010000
#define CPU_SCS_STCSR_COUNTFLAG_S                                   16

// Field: [2]    CLKSOURCE
//
// Clock source:
//
// 0: External reference clock.
// 1: Core clock
//
// External clock is not available in this device. Writes to this field will be
// ignored.
#define CPU_SCS_STCSR_CLKSOURCE                                     0x00000004
#define CPU_SCS_STCSR_CLKSOURCE_BITN                                2
#define CPU_SCS_STCSR_CLKSOURCE_M                                   0x00000004
#define CPU_SCS_STCSR_CLKSOURCE_S                                   2

