GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_cpu_scs.h
// Field: [25]    SETENA25
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 25 (See EVENT:CPUIRQSEL25.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA25                                 0x02000000
#define CPU_SCS_NVIC_ISER0_SETENA25_BITN                            25
#define CPU_SCS_NVIC_ISER0_SETENA25_M                               0x02000000
#define CPU_SCS_NVIC_ISER0_SETENA25_S                               25

// Field: [24]    SETENA24
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 24 (See EVENT:CPUIRQSEL24.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA24                                 0x01000000
#define CPU_SCS_NVIC_ISER0_SETENA24_BITN                            24
#define CPU_SCS_NVIC_ISER0_SETENA24_M                               0x01000000
#define CPU_SCS_NVIC_ISER0_SETENA24_S                               24

// Field: [23]    SETENA23
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 23 (See EVENT:CPUIRQSEL23.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA23                                 0x00800000
#define CPU_SCS_NVIC_ISER0_SETENA23_BITN                            23
#define CPU_SCS_NVIC_ISER0_SETENA23_M                               0x00800000
#define CPU_SCS_NVIC_ISER0_SETENA23_S                               23

// Field: [22]    SETENA22
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 22 (See EVENT:CPUIRQSEL22.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA22                                 0x00400000
#define CPU_SCS_NVIC_ISER0_SETENA22_BITN                            22
#define CPU_SCS_NVIC_ISER0_SETENA22_M                               0x00400000
#define CPU_SCS_NVIC_ISER0_SETENA22_S                               22

// Field: [21]    SETENA21
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 21 (See EVENT:CPUIRQSEL21.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA21                                 0x00200000
#define CPU_SCS_NVIC_ISER0_SETENA21_BITN                            21
#define CPU_SCS_NVIC_ISER0_SETENA21_M                               0x00200000
#define CPU_SCS_NVIC_ISER0_SETENA21_S                               21

// Field: [20]    SETENA20
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 20 (See EVENT:CPUIRQSEL20.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA20                                 0x00100000
#define CPU_SCS_NVIC_ISER0_SETENA20_BITN                            20
#define CPU_SCS_NVIC_ISER0_SETENA20_M                               0x00100000
#define CPU_SCS_NVIC_ISER0_SETENA20_S                               20

// Field: [19]    SETENA19
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 19 (See EVENT:CPUIRQSEL19.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA19                                 0x00080000
#define CPU_SCS_NVIC_ISER0_SETENA19_BITN                            19
#define CPU_SCS_NVIC_ISER0_SETENA19_M                               0x00080000
#define CPU_SCS_NVIC_ISER0_SETENA19_S                               19

// Field: [18]    SETENA18
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 18 (See EVENT:CPUIRQSEL18.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA18                                 0x00040000
#define CPU_SCS_NVIC_ISER0_SETENA18_BITN                            18
#define CPU_SCS_NVIC_ISER0_SETENA18_M                               0x00040000
#define CPU_SCS_NVIC_ISER0_SETENA18_S                               18

// Field: [17]    SETENA17
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 17 (See EVENT:CPUIRQSEL17.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA17                                 0x00020000
#define CPU_SCS_NVIC_ISER0_SETENA17_BITN                            17
#define CPU_SCS_NVIC_ISER0_SETENA17_M                               0x00020000
#define CPU_SCS_NVIC_ISER0_SETENA17_S                               17

// Field: [16]    SETENA16
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 16 (See EVENT:CPUIRQSEL16.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA16                                 0x00010000
#define CPU_SCS_NVIC_ISER0_SETENA16_BITN                            16
#define CPU_SCS_NVIC_ISER0_SETENA16_M                               0x00010000
#define CPU_SCS_NVIC_ISER0_SETENA16_S                               16

// Field: [15]    SETENA15
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 15 (See EVENT:CPUIRQSEL15.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA15                                 0x00008000
#define CPU_SCS_NVIC_ISER0_SETENA15_BITN                            15
#define CPU_SCS_NVIC_ISER0_SETENA15_M                               0x00008000
#define CPU_SCS_NVIC_ISER0_SETENA15_S                               15

// Field: [14]    SETENA14
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 14 (See EVENT:CPUIRQSEL14.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA14                                 0x00004000
#define CPU_SCS_NVIC_ISER0_SETENA14_BITN                            14
#define CPU_SCS_NVIC_ISER0_SETENA14_M                               0x00004000
#define CPU_SCS_NVIC_ISER0_SETENA14_S                               14

// Field: [13]    SETENA13
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 13 (See EVENT:CPUIRQSEL13.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA13                                 0x00002000
#define CPU_SCS_NVIC_ISER0_SETENA13_BITN                            13
#define CPU_SCS_NVIC_ISER0_SETENA13_M                               0x00002000
#define CPU_SCS_NVIC_ISER0_SETENA13_S                               13

// Field: [12]    SETENA12
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 12 (See EVENT:CPUIRQSEL12.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA12                                 0x00001000
#define CPU_SCS_NVIC_ISER0_SETENA12_BITN                            12
#define CPU_SCS_NVIC_ISER0_SETENA12_M                               0x00001000
#define CPU_SCS_NVIC_ISER0_SETENA12_S                               12

