GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_cpu_scs.h
// Field: [21]    SETPEND21
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 21 (See EVENT:CPUIRQSEL21.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND21                                0x00200000
#define CPU_SCS_NVIC_ISPR0_SETPEND21_BITN                           21
#define CPU_SCS_NVIC_ISPR0_SETPEND21_M                              0x00200000
#define CPU_SCS_NVIC_ISPR0_SETPEND21_S                              21

// Field: [20]    SETPEND20
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 20 (See EVENT:CPUIRQSEL20.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND20                                0x00100000
#define CPU_SCS_NVIC_ISPR0_SETPEND20_BITN                           20
#define CPU_SCS_NVIC_ISPR0_SETPEND20_M                              0x00100000
#define CPU_SCS_NVIC_ISPR0_SETPEND20_S                              20

// Field: [19]    SETPEND19
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 19 (See EVENT:CPUIRQSEL19.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND19                                0x00080000
#define CPU_SCS_NVIC_ISPR0_SETPEND19_BITN                           19
#define CPU_SCS_NVIC_ISPR0_SETPEND19_M                              0x00080000
#define CPU_SCS_NVIC_ISPR0_SETPEND19_S                              19

// Field: [18]    SETPEND18
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 18 (See EVENT:CPUIRQSEL18.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND18                                0x00040000
#define CPU_SCS_NVIC_ISPR0_SETPEND18_BITN                           18
#define CPU_SCS_NVIC_ISPR0_SETPEND18_M                              0x00040000
#define CPU_SCS_NVIC_ISPR0_SETPEND18_S                              18

// Field: [17]    SETPEND17
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 17 (See EVENT:CPUIRQSEL17.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND17                                0x00020000
#define CPU_SCS_NVIC_ISPR0_SETPEND17_BITN                           17
#define CPU_SCS_NVIC_ISPR0_SETPEND17_M                              0x00020000
#define CPU_SCS_NVIC_ISPR0_SETPEND17_S                              17

// Field: [16]    SETPEND16
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 16 (See EVENT:CPUIRQSEL16.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND16                                0x00010000
#define CPU_SCS_NVIC_ISPR0_SETPEND16_BITN                           16
#define CPU_SCS_NVIC_ISPR0_SETPEND16_M                              0x00010000
#define CPU_SCS_NVIC_ISPR0_SETPEND16_S                              16

// Field: [15]    SETPEND15
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 15 (See EVENT:CPUIRQSEL15.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND15                                0x00008000
#define CPU_SCS_NVIC_ISPR0_SETPEND15_BITN                           15
#define CPU_SCS_NVIC_ISPR0_SETPEND15_M                              0x00008000
#define CPU_SCS_NVIC_ISPR0_SETPEND15_S                              15

// Field: [14]    SETPEND14
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 14 (See EVENT:CPUIRQSEL14.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND14                                0x00004000
#define CPU_SCS_NVIC_ISPR0_SETPEND14_BITN                           14
#define CPU_SCS_NVIC_ISPR0_SETPEND14_M                              0x00004000
#define CPU_SCS_NVIC_ISPR0_SETPEND14_S                              14

// Field: [13]    SETPEND13
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 13 (See EVENT:CPUIRQSEL13.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND13                                0x00002000
#define CPU_SCS_NVIC_ISPR0_SETPEND13_BITN                           13
#define CPU_SCS_NVIC_ISPR0_SETPEND13_M                              0x00002000
#define CPU_SCS_NVIC_ISPR0_SETPEND13_S                              13

// Field: [12]    SETPEND12
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 12 (See EVENT:CPUIRQSEL12.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND12                                0x00001000
#define CPU_SCS_NVIC_ISPR0_SETPEND12_BITN                           12
#define CPU_SCS_NVIC_ISPR0_SETPEND12_M                              0x00001000
#define CPU_SCS_NVIC_ISPR0_SETPEND12_S                              12

// Field: [11]    SETPEND11
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 11 (See EVENT:CPUIRQSEL11.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND11                                0x00000800
#define CPU_SCS_NVIC_ISPR0_SETPEND11_BITN                           11
#define CPU_SCS_NVIC_ISPR0_SETPEND11_M                              0x00000800
#define CPU_SCS_NVIC_ISPR0_SETPEND11_S                              11

// Field: [10]    SETPEND10
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 10 (See EVENT:CPUIRQSEL10.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND10                                0x00000400
#define CPU_SCS_NVIC_ISPR0_SETPEND10_BITN                           10
#define CPU_SCS_NVIC_ISPR0_SETPEND10_M                              0x00000400
#define CPU_SCS_NVIC_ISPR0_SETPEND10_S                              10

// Field: [9]    SETPEND9
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 9 (See EVENT:CPUIRQSEL9.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND9                                 0x00000200
#define CPU_SCS_NVIC_ISPR0_SETPEND9_BITN                            9
#define CPU_SCS_NVIC_ISPR0_SETPEND9_M                               0x00000200
#define CPU_SCS_NVIC_ISPR0_SETPEND9_S                               9

// Field: [8]    SETPEND8
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 8 (See EVENT:CPUIRQSEL8.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND8                                 0x00000100
#define CPU_SCS_NVIC_ISPR0_SETPEND8_BITN                            8
#define CPU_SCS_NVIC_ISPR0_SETPEND8_M                               0x00000100
#define CPU_SCS_NVIC_ISPR0_SETPEND8_S                               8

